; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	image0 - mode
	spectrograph2 - mode
	image1 - mode
	Star1 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star4)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 180)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 183)
	(supports instrument4 image1)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 168)
	(= (data Planet5 image0) 80)
	(= (data Star6 image0) 7)
	(= (data Planet7 image0) 20)
	(= (data Phenomenon8 image0) 70)
	(= (data Planet9 image0) 234)
	(= (data Planet10 image0) 279)
	(= (data Planet11 image0) 160)
	(= (data Planet12 image0) 267)
	(= (data Phenomenon13 image0) 16)
	(= (data Planet14 image0) 89)
	(= (data Planet5 spectrograph2) 120)
	(= (data Star6 spectrograph2) 10)
	(= (data Planet7 spectrograph2) 113)
	(= (data Phenomenon8 spectrograph2) 156)
	(= (data Planet9 spectrograph2) 44)
	(= (data Planet10 spectrograph2) 175)
	(= (data Planet11 spectrograph2) 294)
	(= (data Planet12 spectrograph2) 254)
	(= (data Phenomenon13 spectrograph2) 206)
	(= (data Planet14 spectrograph2) 198)
	(= (data Planet5 image1) 293)
	(= (data Star6 image1) 2)
	(= (data Planet7 image1) 19)
	(= (data Phenomenon8 image1) 159)
	(= (data Planet9 image1) 105)
	(= (data Planet10 image1) 204)
	(= (data Planet11 image1) 291)
	(= (data Planet12 image1) 96)
	(= (data Phenomenon13 image1) 169)
	(= (data Planet14 image1) 256)
	(= (slew_time Star1 GroundStation0) 36)
	(= (slew_time GroundStation0 Star1) 36)
	(= (slew_time Star3 GroundStation0) 27.76)
	(= (slew_time GroundStation0 Star3) 27.76)
	(= (slew_time Star3 Star1) 7.855)
	(= (slew_time Star1 Star3) 7.855)
	(= (slew_time Star3 GroundStation2) 63.11)
	(= (slew_time GroundStation2 Star3) 63.11)
	(= (slew_time GroundStation2 GroundStation0) 67.85)
	(= (slew_time GroundStation0 GroundStation2) 67.85)
	(= (slew_time GroundStation2 Star1) 39.07)
	(= (slew_time Star1 GroundStation2) 39.07)
	(= (slew_time Star4 GroundStation0) 32.21)
	(= (slew_time GroundStation0 Star4) 32.21)
	(= (slew_time Star4 Star1) 9.802)
	(= (slew_time Star1 Star4) 9.802)
	(= (slew_time Star4 GroundStation2) 80.68)
	(= (slew_time GroundStation2 Star4) 80.68)
	(= (slew_time Star4 Star3) 3.114)
	(= (slew_time Star3 Star4) 3.114)
	(= (slew_time Planet5 GroundStation0) 12.87)
	(= (slew_time GroundStation0 Planet5) 12.87)
	(= (slew_time Planet5 Star1) 24.25)
	(= (slew_time Star1 Planet5) 24.25)
	(= (slew_time Planet5 GroundStation2) 2.927)
	(= (slew_time GroundStation2 Planet5) 2.927)
	(= (slew_time Planet5 Star3) 82.76)
	(= (slew_time Star3 Planet5) 82.76)
	(= (slew_time Planet5 Star4) 0.4998)
	(= (slew_time Star4 Planet5) 0.4998)
	(= (slew_time Star6 GroundStation0) 36.57)
	(= (slew_time GroundStation0 Star6) 36.57)
	(= (slew_time Star6 Star1) 65.01)
	(= (slew_time Star1 Star6) 65.01)
	(= (slew_time Star6 GroundStation2) 19.59)
	(= (slew_time GroundStation2 Star6) 19.59)
	(= (slew_time Star6 Star3) 9.361)
	(= (slew_time Star3 Star6) 9.361)
	(= (slew_time Star6 Star4) 25.96)
	(= (slew_time Star4 Star6) 25.96)
	(= (slew_time Star6 Planet5) 43)
	(= (slew_time Planet5 Star6) 43)
	(= (slew_time Planet7 GroundStation0) 12.14)
	(= (slew_time GroundStation0 Planet7) 12.14)
	(= (slew_time Planet7 Star1) 28.83)
	(= (slew_time Star1 Planet7) 28.83)
	(= (slew_time Planet7 GroundStation2) 38.77)
	(= (slew_time GroundStation2 Planet7) 38.77)
	(= (slew_time Planet7 Star3) 3.507)
	(= (slew_time Star3 Planet7) 3.507)
	(= (slew_time Planet7 Star4) 30.4)
	(= (slew_time Star4 Planet7) 30.4)
	(= (slew_time Planet7 Planet5) 4.493)
	(= (slew_time Planet5 Planet7) 4.493)
	(= (slew_time Planet7 Star6) 61.79)
	(= (slew_time Star6 Planet7) 61.79)
	(= (slew_time Phenomenon8 GroundStation0) 10.58)
	(= (slew_time GroundStation0 Phenomenon8) 10.58)
	(= (slew_time Phenomenon8 Star1) 44.35)
	(= (slew_time Star1 Phenomenon8) 44.35)
	(= (slew_time Phenomenon8 GroundStation2) 2.784)
	(= (slew_time GroundStation2 Phenomenon8) 2.784)
	(= (slew_time Phenomenon8 Star3) 49.51)
	(= (slew_time Star3 Phenomenon8) 49.51)
	(= (slew_time Phenomenon8 Star4) 56.78)
	(= (slew_time Star4 Phenomenon8) 56.78)
	(= (slew_time Phenomenon8 Planet5) 16.29)
	(= (slew_time Planet5 Phenomenon8) 16.29)
	(= (slew_time Phenomenon8 Star6) 31.76)
	(= (slew_time Star6 Phenomenon8) 31.76)
	(= (slew_time Phenomenon8 Planet7) 19.24)
	(= (slew_time Planet7 Phenomenon8) 19.24)
	(= (slew_time Planet9 GroundStation0) 9.85)
	(= (slew_time GroundStation0 Planet9) 9.85)
	(= (slew_time Planet9 Star1) 78.59)
	(= (slew_time Star1 Planet9) 78.59)
	(= (slew_time Planet9 GroundStation2) 42.54)
	(= (slew_time GroundStation2 Planet9) 42.54)
	(= (slew_time Planet9 Star3) 1.908)
	(= (slew_time Star3 Planet9) 1.908)
	(= (slew_time Planet9 Star4) 32.61)
	(= (slew_time Star4 Planet9) 32.61)
	(= (slew_time Planet9 Planet5) 23.31)
	(= (slew_time Planet5 Planet9) 23.31)
	(= (slew_time Planet9 Star6) 26.54)
	(= (slew_time Star6 Planet9) 26.54)
	(= (slew_time Planet9 Planet7) 55.34)
	(= (slew_time Planet7 Planet9) 55.34)
	(= (slew_time Planet9 Phenomenon8) 34.41)
	(= (slew_time Phenomenon8 Planet9) 34.41)
	(= (slew_time Planet10 GroundStation0) 8.813)
	(= (slew_time GroundStation0 Planet10) 8.813)
	(= (slew_time Planet10 Star1) 48.98)
	(= (slew_time Star1 Planet10) 48.98)
	(= (slew_time Planet10 GroundStation2) 19.81)
	(= (slew_time GroundStation2 Planet10) 19.81)
	(= (slew_time Planet10 Star3) 69.43)
	(= (slew_time Star3 Planet10) 69.43)
	(= (slew_time Planet10 Star4) 18.19)
	(= (slew_time Star4 Planet10) 18.19)
	(= (slew_time Planet10 Planet5) 0.4264)
	(= (slew_time Planet5 Planet10) 0.4264)
	(= (slew_time Planet10 Star6) 3.051)
	(= (slew_time Star6 Planet10) 3.051)
	(= (slew_time Planet10 Planet7) 36.45)
	(= (slew_time Planet7 Planet10) 36.45)
	(= (slew_time Planet10 Phenomenon8) 1.844)
	(= (slew_time Phenomenon8 Planet10) 1.844)
	(= (slew_time Planet10 Planet9) 47.25)
	(= (slew_time Planet9 Planet10) 47.25)
	(= (slew_time Planet11 GroundStation0) 0.156)
	(= (slew_time GroundStation0 Planet11) 0.156)
	(= (slew_time Planet11 Star1) 33.12)
	(= (slew_time Star1 Planet11) 33.12)
	(= (slew_time Planet11 GroundStation2) 38.65)
	(= (slew_time GroundStation2 Planet11) 38.65)
	(= (slew_time Planet11 Star3) 51.84)
	(= (slew_time Star3 Planet11) 51.84)
	(= (slew_time Planet11 Star4) 28.08)
	(= (slew_time Star4 Planet11) 28.08)
	(= (slew_time Planet11 Planet5) 10.07)
	(= (slew_time Planet5 Planet11) 10.07)
	(= (slew_time Planet11 Star6) 9.628)
	(= (slew_time Star6 Planet11) 9.628)
	(= (slew_time Planet11 Planet7) 30.23)
	(= (slew_time Planet7 Planet11) 30.23)
	(= (slew_time Planet11 Phenomenon8) 5.873)
	(= (slew_time Phenomenon8 Planet11) 5.873)
	(= (slew_time Planet11 Planet9) 30.67)
	(= (slew_time Planet9 Planet11) 30.67)
	(= (slew_time Planet11 Planet10) 49.85)
	(= (slew_time Planet10 Planet11) 49.85)
	(= (slew_time Planet12 GroundStation0) 33.82)
	(= (slew_time GroundStation0 Planet12) 33.82)
	(= (slew_time Planet12 Star1) 23.47)
	(= (slew_time Star1 Planet12) 23.47)
	(= (slew_time Planet12 GroundStation2) 44.64)
	(= (slew_time GroundStation2 Planet12) 44.64)
	(= (slew_time Planet12 Star3) 19.93)
	(= (slew_time Star3 Planet12) 19.93)
	(= (slew_time Planet12 Star4) 23.88)
	(= (slew_time Star4 Planet12) 23.88)
	(= (slew_time Planet12 Planet5) 31.33)
	(= (slew_time Planet5 Planet12) 31.33)
	(= (slew_time Planet12 Star6) 69.23)
	(= (slew_time Star6 Planet12) 69.23)
	(= (slew_time Planet12 Planet7) 22.81)
	(= (slew_time Planet7 Planet12) 22.81)
	(= (slew_time Planet12 Phenomenon8) 71.29)
	(= (slew_time Phenomenon8 Planet12) 71.29)
	(= (slew_time Planet12 Planet9) 45.56)
	(= (slew_time Planet9 Planet12) 45.56)
	(= (slew_time Planet12 Planet10) 52.3)
	(= (slew_time Planet10 Planet12) 52.3)
	(= (slew_time Planet12 Planet11) 69.74)
	(= (slew_time Planet11 Planet12) 69.74)
	(= (slew_time Phenomenon13 GroundStation0) 76.71)
	(= (slew_time GroundStation0 Phenomenon13) 76.71)
	(= (slew_time Phenomenon13 Star1) 49.05)
	(= (slew_time Star1 Phenomenon13) 49.05)
	(= (slew_time Phenomenon13 GroundStation2) 3.523)
	(= (slew_time GroundStation2 Phenomenon13) 3.523)
	(= (slew_time Phenomenon13 Star3) 77.93)
	(= (slew_time Star3 Phenomenon13) 77.93)
	(= (slew_time Phenomenon13 Star4) 50.55)
	(= (slew_time Star4 Phenomenon13) 50.55)
	(= (slew_time Phenomenon13 Planet5) 68.94)
	(= (slew_time Planet5 Phenomenon13) 68.94)
	(= (slew_time Phenomenon13 Star6) 26.46)
	(= (slew_time Star6 Phenomenon13) 26.46)
	(= (slew_time Phenomenon13 Planet7) 5.808)
	(= (slew_time Planet7 Phenomenon13) 5.808)
	(= (slew_time Phenomenon13 Phenomenon8) 3.875)
	(= (slew_time Phenomenon8 Phenomenon13) 3.875)
	(= (slew_time Phenomenon13 Planet9) 41.21)
	(= (slew_time Planet9 Phenomenon13) 41.21)
	(= (slew_time Phenomenon13 Planet10) 29.47)
	(= (slew_time Planet10 Phenomenon13) 29.47)
	(= (slew_time Phenomenon13 Planet11) 6.788)
	(= (slew_time Planet11 Phenomenon13) 6.788)
	(= (slew_time Phenomenon13 Planet12) 23.11)
	(= (slew_time Planet12 Phenomenon13) 23.11)
	(= (slew_time Planet14 GroundStation0) 0.006999)
	(= (slew_time GroundStation0 Planet14) 0.006999)
	(= (slew_time Planet14 Star1) 61.24)
	(= (slew_time Star1 Planet14) 61.24)
	(= (slew_time Planet14 GroundStation2) 48.1)
	(= (slew_time GroundStation2 Planet14) 48.1)
	(= (slew_time Planet14 Star3) 22.78)
	(= (slew_time Star3 Planet14) 22.78)
	(= (slew_time Planet14 Star4) 7.974)
	(= (slew_time Star4 Planet14) 7.974)
	(= (slew_time Planet14 Planet5) 31.78)
	(= (slew_time Planet5 Planet14) 31.78)
	(= (slew_time Planet14 Star6) 33.98)
	(= (slew_time Star6 Planet14) 33.98)
	(= (slew_time Planet14 Planet7) 28.48)
	(= (slew_time Planet7 Planet14) 28.48)
	(= (slew_time Planet14 Phenomenon8) 40.24)
	(= (slew_time Phenomenon8 Planet14) 40.24)
	(= (slew_time Planet14 Planet9) 59.39)
	(= (slew_time Planet9 Planet14) 59.39)
	(= (slew_time Planet14 Planet10) 45.17)
	(= (slew_time Planet10 Planet14) 45.17)
	(= (slew_time Planet14 Planet11) 51.93)
	(= (slew_time Planet11 Planet14) 51.93)
	(= (slew_time Planet14 Planet12) 31.12)
	(= (slew_time Planet12 Planet14) 31.12)
	(= (slew_time Planet14 Phenomenon13) 26.78)
	(= (slew_time Phenomenon13 Planet14) 26.78)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Planet11)
	(have_image Planet5 image1)
	(have_image Star6 image1)
	(have_image Planet7 image0)
	(have_image Phenomenon8 image0)
	(have_image Planet9 image1)
	(have_image Planet10 image0)
	(have_image Planet11 spectrograph2)
	(have_image Planet12 spectrograph2)
	(have_image Phenomenon13 spectrograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 phenomenon8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 183 to 166.71, (fuel-used) from 0 to 16.29
   goals met: 0 of 10
2. (turn_to satellite2 planet11 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 168 to 157.93, (fuel-used) from 16.29 to 26.36
   goals met: 1 of 10
3. (turn_to satellite0 star4 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 180 to 156.12, (fuel-used) from 26.36 to 50.24
   goals met: 1 of 10
4. (turn_to satellite1 planet11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 166.71 to 160.837, (fuel-used) from 50.24 to 56.113
   goals met: 1 of 10
5. (turn_to satellite0 phenomenon8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 156.12 to 99.34, (fuel-used) from 56.113 to 112.893
   goals met: 1 of 10
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
7. (turn_to satellite1 groundstation0 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 160.837 to 160.681, (fuel-used) from 112.893 to 113.049
   goals met: 1 of 10
8. (turn_to satellite1 planet11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 160.681 to 160.525, (fuel-used) from 113.049 to 113.205
   goals met: 1 of 10
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
10. (turn_to satellite1 groundstation0 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 160.525 to 160.369, (fuel-used) from 113.205 to 113.361
   goals met: 1 of 10
11. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 10
12. (turn_to satellite1 planet11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 160.369 to 160.213, (fuel-used) from 113.361 to 113.517
   goals met: 1 of 10
13. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 99.34 to 97.496, (fuel-used) from 113.517 to 115.361
   goals met: 1 of 10
14. (take_image satellite1 planet11 instrument2 spectrograph2)
   added: (have_image planet11 spectrograph2)
   changed: (data_capacity satellite1) from 1000 to 706, (data-stored) from 0 to 294
   goals met: 2 of 10
15. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 97.496 to 95.652, (fuel-used) from 115.361 to 117.205
   goals met: 2 of 10
16. (turn_to satellite0 star6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 95.652 to 63.892, (fuel-used) from 117.205 to 148.965
   goals met: 2 of 10
17. (turn_to satellite1 phenomenon13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon13)
   changed: (fuel satellite1) from 160.213 to 153.425, (fuel-used) from 148.965 to 155.753
   goals met: 2 of 10
18. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   changed: (fuel satellite1) from 153.425 to 130.315, (fuel-used) from 155.753 to 178.863
   goals met: 2 of 10
19. (turn_to satellite0 phenomenon8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 63.892 to 32.132, (fuel-used) from 178.863 to 210.623
   goals met: 2 of 10
20. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 10
21. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 32.132 to 30.288, (fuel-used) from 210.623 to 212.467
   goals met: 2 of 10
22. (turn_to satellite0 planet5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 30.288 to 29.8616, (fuel-used) from 212.467 to 212.893
   goals met: 2 of 10
23. (turn_to satellite0 star4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 29.8616 to 29.3618, (fuel-used) from 212.893 to 213.393
   goals met: 2 of 10
24. (turn_to satellite0 planet5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 29.3618 to 28.862, (fuel-used) from 213.393 to 213.893
   goals met: 2 of 10
25. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 28.862 to 28.4356, (fuel-used) from 213.893 to 214.319
   goals met: 2 of 10
26. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 28.4356 to 26.5916, (fuel-used) from 214.319 to 216.163
   goals met: 2 of 10
27. (take_image satellite1 planet12 instrument2 spectrograph2)
   added: (have_image planet12 spectrograph2)
   changed: (data_capacity satellite1) from 706 to 452, (data-stored) from 294 to 548
   goals met: 3 of 10
28. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
29. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 26.5916 to 24.7476, (fuel-used) from 216.163 to 218.007
   goals met: 3 of 10
30. (turn_to satellite0 planet5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 24.7476 to 24.3212, (fuel-used) from 218.007 to 218.434
   goals met: 3 of 10
31. (turn_to satellite0 star4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 24.3212 to 23.8214, (fuel-used) from 218.434 to 218.934
   goals met: 3 of 10
32. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 3 of 10
33. (turn_to satellite0 star3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 23.8214 to 20.7074, (fuel-used) from 218.934 to 222.048
   goals met: 3 of 10
34. (turn_to satellite0 planet7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 20.7074 to 17.2004, (fuel-used) from 222.048 to 225.555
   goals met: 3 of 10
35. (take_image satellite0 planet7 instrument0 image0)
   added: (have_image planet7 image0)
   changed: (data_capacity satellite0) from 1000 to 980, (data-stored) from 548 to 568
   goals met: 4 of 10
36. (turn_to satellite0 planet5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 17.2004 to 12.7074, (fuel-used) from 225.555 to 230.048
   goals met: 4 of 10
37. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   changed: (data_capacity satellite0) from 980 to 687, (data-stored) from 568 to 861
   goals met: 5 of 10
38. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 12.7074 to 12.281, (fuel-used) from 230.048 to 230.474
   goals met: 5 of 10
39. (turn_to satellite0 star6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 12.281 to 9.23, (fuel-used) from 230.474 to 233.525
   goals met: 5 of 10
40. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   changed: (data_capacity satellite0) from 687 to 685, (data-stored) from 861 to 863
   goals met: 6 of 10
41. (turn_to satellite0 planet10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 9.23 to 6.179, (fuel-used) from 233.525 to 236.576
   goals met: 6 of 10
42. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   changed: (data_capacity satellite0) from 685 to 406, (data-stored) from 863 to 1142
   goals met: 7 of 10
43. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 6.179 to 4.335, (fuel-used) from 236.576 to 238.42
   goals met: 7 of 10
44. (take_image satellite0 phenomenon8 instrument0 image0)
   added: (have_image phenomenon8 image0)
   changed: (data_capacity satellite0) from 406 to 336, (data-stored) from 1142 to 1212
   goals met: 8 of 10
45. (turn_to satellite0 phenomenon13 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon13)
   changed: (fuel satellite0) from 4.335 to 0.46, (fuel-used) from 238.42 to 242.295
   goals met: 8 of 10
46. (turn_to satellite2 star4 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 157.93 to 129.85, (fuel-used) from 242.295 to 270.375
   goals met: 7 of 10
47. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 7 of 10
48. (calibrate satellite2 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 7 of 10
49. (turn_to satellite2 planet9 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet9)
   changed: (fuel satellite2) from 129.85 to 97.24, (fuel-used) from 270.375 to 302.985
   goals met: 7 of 10
50. (take_image satellite2 planet9 instrument4 image1)
   added: (have_image planet9 image1)
   changed: (data_capacity satellite2) from 1000 to 895, (data-stored) from 1212 to 1317
   goals met: 8 of 10
51. (turn_to satellite2 planet11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 97.24 to 66.57, (fuel-used) from 302.985 to 333.655
   goals met: 9 of 10
52. (take_image satellite0 phenomenon13 instrument0 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   changed: (data_capacity satellite0) from 336 to 130, (data-stored) from 1317 to 1523
   goals met: 10 of 10
